package com.hillel.protsenko.lessons.lesson7;

public class AdditionalHomework {
    public static void main(String[] args) {
        //Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].
        //
        //Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.
        //
        //Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.
        //
        //Дан масив [1, 2, 3, 4, 5]. Перетворіть масив на [1, 2, 10, 3, 4, 5].
        //
        //Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.
        //
        //Дан масив з елементами 'Привіт, ', 'світ' і '!'. Необхідно вивести на екран фразу 'Привіт, світ!'.
        //
        //Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.
        //
        //Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, яку передав користувач. у кожному індексі масиву зберігайте чило яке показуватиме номер елемента масиву.
        //
        //Задание:
        //Напишите сценарий, который найдет в массиве все отрицательные значения и заменить их на значения 0.
        //После этого выведет на экран все элементы массива.
        //int[] values = {10, 20, -2, 6, 11, -10, 125, -3, 8, 0, 3};
        //
        //Задание:
        //Дано массив.Создайте на оснoвое значений этого массива два новых массива.В один массив поместите все четные значения, а во второй все нечетные.
        //Выведите на экран значения, которые вошли в первый массив и во второй массив.
        //
        //int[] values = {10, 20, 5, 7, 11, 8, 125, 4, 8, 3, 23};
        //
        //Задание:
        //Найдите первый положительный элемент массива и выведите его на экран.
        //
        //int[] values = {-1, -5, -6, -3, -10, -5, 3, 4, -1, -8, 1, -10, 3};
        //
        //Задание:
        //Данно массив.Поменяйте элемент с максимальным значением местами с элементом с минимальным значением.
        //
        //int[] values = {10, 20, 4, 6, 11, 9, 125, 1, 8, 0, 3};
        //
        //

        //Задание:
        //Дано массив.Найдите среднее арифметическое для значений этого массива.
        //Выведите на экран только те элементы, которые больше этого среднего арифместического значения
        //
        //int[] values = {10, 20, 48, 6, 11, 9, 125, 1, 8, 0, 3, 255, 77, 11, 170, 4, 28};
    }
}
